tiborsimon/embedded-tdd-headers/pic/8bit/pic18f6622_tdd.h
#define LATB1                         522
#define LB2                           523
#define LATB2                         524
#define LB3                           525
#define LATB3                         526
#define LB4                           527
#define LATB4                         528
#define LB5                           529
#define LATB5                         530
#define LB6                           531
#define LATB6                         532
#define LB7                           533
#define LATB7                         534
#define LATC                          535
#define LATC0                         536
#define LC0                           537
#define LATC1                         538
#define LC1                           539
#define LATC2                         540
#define LC2                           541
#define LATC3                         542
#define LC3                           543
#define LATC4                         544
#define LC4                           545
#define LATC5                         546
#define LC5                           547
#define LATC6                         548
#define LC6                           549
#define LATC7                         550
#define LC7                           551
#define LATD                          552
#define LATD0                         553
#define LD0                           554
#define LATD1                         555
#define LD1                           556
#define LATD2                         557
#define LD2                           558
#define LATD3                         559
#define LD3                           560
#define LATD4                         561
#define LD4                           562
#define LATD5                         563
#define LD5                           564
#define LATD6                         565
#define LD6                           566
#define LATD7                         567
#define LD7                           568
#define LATE                          569
#define LATE0                         570
#define LE0                           571
#define LATE1                         572
#define LE1                           573
#define LATE2                         574
#define LE2                           575
#define LATE3                         576
#define LE3                           577
#define LATE4                         578
#define LE4                           579
#define LATE5                         580
#define LE5                           581
#define LATE6                         582
#define LE6                           583
#define LATE7                         584
#define LE7                           585
#define LATF                          586
#define LATF0                         587
#define LF0                           588
#define LATF1                         589
#define LF1                           590
#define LF2                           591
#define LATF2                         592
#define LF3                           593
#define LATF3                         594
#define LF4                           595
#define LATF4                         596
#define LF5                           597
#define LATF5                         598
#define LF6                           599
#define LATF6                         600
#define LF7                           601
#define LATF7                         602
#define LATG                          603
#define LATG0                         604
#define LG0                           605
#define LATG1                         606
#define LG1                           607
#define LATG2                         608
#define LG2                           609
#define LATG3                         610
#define LG3                           611
#define LATG4                         612
#define LG4                           613
#define LATG5                         614
#define TRISA                         615
#define TRISA0                        616
#define TRISA_RA0                     617
#define TRISA1                        618
#define TRISA_RA1                     619
#define TRISA2                        620
#define TRISA_RA2                     621
#define TRISA3                        622
#define TRISA_RA3                     623
#define TRISA_RA4                     624
#define TRISA4                        625
#define TRISA_RA5                     626
#define TRISA5                        627
#define TRISA_RA6                     628
#define TRISA6                        629
#define TRISA_RA7                     630
#define TRISA7                        631
#define TRISB                         632
#define TRISB_RB0                     633
#define TRISB0                        634
#define TRISB_RB1                     635
#define TRISB1                        636
#define TRISB_RB2                     637
#define TRISB2                        638
#define TRISB_RB3                     639
#define TRISB3                        640
#define TRISB_RB4                     641
#define TRISB4                        642
#define TRISB_RB5                     643
#define TRISB5                        644
#define TRISB_RB6                     645
#define TRISB6                        646
#define TRISB_RB7                     647
#define TRISB7                        648
#define TRISC                         649
#define TRISC0                        650
#define TRISC_RC0                     651
#define TRISC1                        652
#define TRISC_RC1                     653
#define TRISC2                        654
#define TRISC_RC2                     655
#define TRISC3                        656
#define TRISC_RC3                     657
#define TRISC4                        658
#define TRISC_RC4                     659
#define TRISC5                        660
#define TRISC_RC5                     661
#define TRISC6                        662
#define TRISC_RC6                     663
#define TRISC7                        664
#define TRISC_RC7                     665
#define TRISD                         666
#define TRISD_RD0                     667
#define TRISD0                        668
#define TRISD_RD1                     669
#define TRISD1                        670
#define TRISD_RD2                     671
#define TRISD2                        672
#define TRISD_RD3                     673
#define TRISD3                        674
#define TRISD_RD4                     675
#define TRISD4                        676
#define TRISD_RD5                     677
#define TRISD5                        678
#define TRISD_RD6                     679
#define TRISD6                        680
#define TRISD_RD7                     681
#define TRISD7                        682
#define TRISE                         683
#define TRISE_RE0                     684
#define TRISE0                        685
#define TRISE1                        686
#define TRISE_RE1                     687
#define TRISE2                        688
#define TRISE_RE2                     689
#define TRISE_RE3                     690
#define TRISE3                        691
#define TRISE_RE4                     692
#define TRISE4                        693
#define TRISE_RE5                     694
#define TRISE5                        695
#define TRISE_RE6                     696
#define TRISE6                        697
#define TRISE_RE7                     698
#define TRISE7                        699
#define TRISF                         700
#define TRISF0                        701
#define TRISF_RF0                     702
#define TRISF_RF1                     703
#define TRISF1                        704
#define TRISF_RF2                     705
#define TRISF2                        706
#define TRISF3                        707
#define TRISF_RF3                     708
#define TRISF_RF4                     709
#define TRISF4                        710
#define TRISF_RF5                     711
#define TRISF5                        712
#define TRISF_RF6                     713
#define TRISF6                        714
#define TRISF7                        715
#define TRISF_RF7                     716
#define TRISG                         717
#define TRISG0                        718
#define TRISG_RG0                     719
#define TRISG1                        720
#define TRISG_RG1                     721
#define TRISG2                        722
#define TRISG_RG2                     723
#define TRISG_RG3                     724
#define TRISG3                        725
#define TRISG4                        726
#define TRISG_RG4                     727
#define OSCTUNE                       728
#define TUN0                          729
#define TUN                           730
#define TUN1                          731
#define TUN2                          732
#define TUN3                          733
#define TUN4                          734
#define PLLEN                         735
#define INTSRC                        736
#define PIE1                          737
#define TMR1IE                        738
#define TMR2IE                        739
#define CCP1IE                        740
#define SSP1IE                        741
#define SSPIE                         742
#define TXIE                          743
#define TX1IE                         744
#define RC1IE                         745
#define RCIE                          746
#define ADIE                          747
#define PSPIE                         748
#define PIR1                          749
#define TMR1IF                        750
#define TMR2IF                        751
#define CCP1IF                        752
#define SSPIF                         753
#define SSP1IF                        754
#define TXIF                          755
#define TX1IF                         756
#define RCIF                          757
#define RC1IF                         758
#define ADIF                          759
#define PSPIF                         760
#define IPR1                          761
#define TMR1IP                        762
#define TMR2IP                        763
#define CCP1IP                        764
#define SSPIP                         765
#define SSP1IP                        766
#define TX1IP                         767
#define TXIP                          768
#define RCIP                          769
#define RC1IP                         770
#define ADIP                          771
#define PSPIP                         772
#define PIE2                          773
#define CCP2IE                        774
#define TMR3IE                        775
#define HLVDIE                        776
#define LVDIE                         777
#define BCL1IE                        778
#define BCLIE                         779
#define EEIE                          780
#define CMIE                          781
#define OSCFIE                        782
#define PIR2                          783
#define CCP2IF                        784
#define TMR3IF                        785
#define HLVDIF                        786
#define LVDIF                         787
#define BCL1IF                        788
#define BCLIF                         789
#define EEIF                          790
#define CMIF                          791
#define OSCFIF                        792
#define IPR2                          793
#define CCP2IP                        794
#define TMR3IP                        795
#define HLVDIP                        796
#define LVDIP                         797
#define BCLIP                         798
#define BCL1IP                        799
#define EEIP                          800
#define CMIP                          801
#define OSCFIP                        802
#define PIE3                          803
#define CCP3IE                        804
#define RXB0IE                        805
#define RXBNIE                        806
#define RXB1IE                        807
#define CCP4IE                        808
#define TXB0IE                        809
#define CCP5IE                        810
#define TXB1IE                        811
#define TMR4IE                        812
#define TXB2IE                        813
#define TXBNIE                        814
#define TX2IE                         815
#define RC2IE                         816
#define BCL2IE                        817
#define SSP2IE                        818
#define PIR3                          819
#define CCP3IF                        820
#define RXBNIF                        821
#define CCP4IF                        822
#define CCP5IF                        823
#define TMR4IF                        824
#define TXBNIF                        825
#define TX2IF                         826
#define RC2IF                         827
#define BCL2IF                        828
#define SSP2IF                        829
#define IPR3                          830
#define CCP3IP                        831
#define CCP4IP                        832
#define RXBNIP                        833
#define CCP5IP                        834
#define TMR4IP                        835
#define TX2IP                         836
#define TXBNIP                        837
#define RC2IP                         838
#define BCL2IP                        839
#define SSP2IP                        840
#define EECON1                        841
#define EECON1_RD                     842
#define EECON1_WR                     843
#define WREN                          844
#define WRERR                         845
#define FREE                          846
#define CFGS                          847
#define EEFS                          848
#define EEPGD                         849
#define RCSTA1                        850
#define RCSTA1_RX9D                   851
#define RX9D1                         852
#define RCSTA1_RCD8                   853
#define RCSTA1_OERR                   854
#define OERR1                         855
#define RCSTA1_FERR                   856
#define FERR1                         857
#define RCSTA1_ADDEN                  858
#define ADDEN1                        859
#define RCSTA1_CREN                   860
#define CREN1                         861
#define SRENA                         862
#define SREN1                         863
#define RCSTA1_SREN                   864
#define RCSTA1_NOT_RC8                865
#define RCSTA1_RC9                    866
#define RCSTA1_nRC8                   867
#define RCSTA1_RC8_9                  868
#define RCSTA1_RX9                    869
#define RX91                          870
#define RCSTA1_SPEN                   871
#define SPEN1                         872
#define TXSTA1                        873
#define TX9D1                         874
#define TXSTA1_TX9D                   875
#define TXSTA1_TXD8                   876
#define TRMT1                         877
#define TXSTA1_TRMT                   878
#define BRGH1                         879
#define TXSTA1_BRGH                   880
#define TXSTA1_SENDB                  881
#define SENDB1                        882
#define TXSTA1_SYNC                   883
#define SYNC1                         884
#define TXEN1                         885
#define TXSTA1_TXEN                   886
#define TX91                          887
#define TXSTA1_NOT_TX8                888
#define TXSTA1_TX8_9                  889
#define TXSTA1_TX9                    890
#define TXSTA1_nTX8                   891
#define TXSTA1_CSRC                   892
#define CSRC1                         893
#define PSPCON                        894
#define PSPMODE                       895
#define IBOV                          896
#define OBF                           897
#define IBF                           898
#define T3CON                         899
#define TMR3ON                        900
#define TMR3CS                        901
#define nT3SYNC                       902
#define NOT_T3SYNC                    903
#define T3SYNC                        904
#define T3INSYNC                      905
#define SOSCEN3                       906
#define T3CCP1                        907
#define T3CKPS                        908
#define T3CKPS0                       909
#define T3CKPS1                       910
#define T3CCP2                        911
#define T3CON_RD16                    912
#define RD163                         913
#define T3RD16                        914
#define CMCON                         915
#define CM                            916
#define CMEN0                         917
#define CM0                           918
#define CMEN1                         919
#define CM1                           920
#define CMEN2                         921
#define CM2                           922
#define CIS                           923
#define C1INV                         924
#define C2INV                         925
#define CMCON_C1OUT                   926
#define CMCON_C2OUT                   927
#define CVRCON                        928
#define CVR                           929
#define CVR0                          930
#define CVR1                          931
#define CVR2                          932
#define CVR3                          933
#define CVRSS                         934
#define CVRR                          935
#define CVROEN                        936
#define CVROE                         937
#define CVREN                         938
#define PSS1BD                        939
#define ECCP1AS_PSSBD0                940
#define PSS1BD0                       941
#define ECCP1AS_PSSBD1                942
#define PSS1BD1                       943
#define PSS1AC                        944
#define ECCP1AS_PSSAC0                945
#define PSS1AC0                       946
#define ECCP1AS_PSSAC1                947
#define PSS1AC1                       948
#define ECCP1AS                       949
#define ECCP1AS_ECCPAS0               950
#define ECCP1AS0                      951
#define ECCP1AS_ECCPAS1               952
#define ECCP1AS1                      953
#define ECCP1AS_ECCPAS2               954
#define ECCP1AS2                      955
#define ECCP1ASE                      956
#define ECCP1AS_ECCPASE               957
#define CCP3CON                       958
#define CCP3M                         959
#define CCP3M0                        960
#define CCP3M1                        961
#define CCP3M2                        962
#define CCP3M3                        963
#define CCP3Y                         964
#define DC3B                          965
#define DC3B0                         966
#define DC3B1                         967
#define CCP3X                         968
#define P3M                           969
#define P3M0                          970
#define P3M1                          971
#define CCP2CON                       972
#define CCP2M                         973
#define CCP2M0                        974
#define CCP2M1                        975
#define CCP2M2                        976
#define CCP2M3                        977
#define DC2B                          978
#define DC2B0                         979
#define CCP2Y                         980
#define DC2B1                         981
#define CCP2X                         982
#define P2M                           983
#define P2M0                          984
#define P2M1                          985
#define CCP1CON                       986
#define CCP1M0                        987
#define CCP1M                         988
#define CCP1M1                        989
#define CCP1M2                        990
#define CCP1M3                        991
#define CCP1Y                         992
#define DC1B                          993
#define DC1B0                         994
#define CCP1X                         995
#define DC1B1                         996
#define P1M                           997
#define P1M0                          998
#define P1M1                          999
#define ADCON2                        1000
#define ADCS0                         1001
#define ADCS                          1002
#define ADCS1                         1003
#define ADCS2                         1004
#define ACQT0                         1005
#define ACQT                          1006
#define ACQT1                         1007
#define ACQT2                         1008
#define ADFM                          1009
#define ADCON1                        1010
#define PCFG0                         1011
#define PCFG                          1012
#define PCFG1                         1013
#define PCFG2                         1014
#define CHSN3                         1015
#define PCFG3                         1016
#define VCFG                          1017
#define VCFG0                         1018
#define VCFG01                        1019
#define VCFG11                        1020
#define VCFG1                         1021
#define ADCON0                        1022
#define ADON                          1023
#define nDONE                         1024
#define GO_nDONE                      1025
#define NOT_DONE                      1026
#define GODONE                        1027
#define GO_DONE                       1028
#define DONE                          1029
#define GO                            1030
#define GO_NOT_DONE                   1031
#define CHS                           1032
#define CHS0                          1033
#define CHS1                          1034
#define CHS2                          1035
#define CHS3                          1036
#define SSP1CON2                      1037
#define SEN1                          1038
#define SSP1CON2_SEN                  1039
#define ADMSK11                       1040
#define SSP1CON2_RSEN                 1041
#define RSEN1                         1042
#define ADMSK1                        1043
#define SSP1CON2_PEN                  1044
#define ADMSK21                       1045
#define PEN1                          1046
#define ADMSK2                        1047
#define ADMSK31                       1048
#define RCEN1                         1049
#define SSP1CON2_RCEN                 1050
#define ADMSK3                        1051
#define SSP1CON2_ACKEN                1052
#define ACKEN1                        1053
#define ADMSK41                       1054
#define ADMSK4                        1055
#define ACKDT1                        1056
#define ADMSK51                       1057
#define SSP1CON2_ACKDT                1058
#define ADMSK5                        1059
#define SSP1CON2_ACKSTAT              1060
#define ACKSTAT1                      1061
#define GCEN1                         1062
#define SSP1CON2_GCEN                 1063
#define SSP1CON1                      1064
#define SSP1CON1_SSPM0                1065
#define SSPM01                        1066
#define SSP1CON1_SSPM                 1067
#define SSP1CON1_SSPM1                1068
#define SSPM11                        1069
#define SSP1CON1_SSPM2                1070
#define SSPM21                        1071
#define SSPM31                        1072
#define SSP1CON1_SSPM3                1073
#define SSP1CON1_CKP                  1074
#define CKP1                          1075
#define SSPEN1                        1076
#define SSP1CON1_SSPEN                1077
#define SSPOV1                        1078
#define SSP1CON1_SSPOV                1079
#define WCOL1                         1080
#define SSP1CON1_WCOL                 1081
#define SSP1STAT                      1082
#define BF1                           1083
#define SSP1STAT_BF                   1084
#define UA1                           1085
#define SSP1STAT_UA                   1086
#define SSP1STAT_R_NOT_W              1087
#define RW1                           1088
#define NOT_W                         1089
#define SSP1STAT_R                    1090
